
## Plan Result




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_access_key
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis
  * module.prl-citizen-frontend-session-storage.azurerm_resource_group.cache-resourcegroup
* Update
  * azurerm_key_vault_secret.sendgrid_api_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat"
      + name           = "redis-access-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.sendgrid_api_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sendgrid_api_key" {
        id             = "https://prl-aat.vault.azure.net/secrets/send-grid-api-key/dbebb8643e444b509e91ea200e782940"
        name           = "send-grid-api-key"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat|prl-aat"
        name                       = "prl-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "prl-citizen-frontend-redis-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "prl-citizen-frontend-redis-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "application"         = "family-private-law"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "staging"
          + "managedBy"           = "Private Law"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 300
          + maxmemory_delta                 = 200
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 200
        }
    }

  # module.prl-citizen-frontend-session-storage.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "prl-citizen-frontend-redis-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "application"         = "family-private-law"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "staging"
          + "managedBy"           = "Private Law"
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault_secret.sendgrid_api_key has changed
  ~ resource "azurerm_key_vault_secret" "sendgrid_api_key" {
        id             = "https://prl-aat.vault.azure.net/secrets/send-grid-api-key/dbebb8643e444b509e91ea200e782940"
        name           = "send-grid-api-key"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = "dbebb8643e444b509e91ea200e782940" -> "2beeca4492544189bfa22a2daf5ea812"
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat|prl-aat"
        name                       = "prl-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"","Vars":{}} -->